app/controllers/home_controller.rb

SELECT * FROM "users"
SELECT * FROM "teams"
---
  def index
    @matches = Match.all(:limit => 10, :order => 'created_at desc')
    @users = User.all.sort_by(&:matches_won_count).reverse
    @teams = Team.all.sort_by(&:matches_won_count).reverse