app/controllers/matches_controller.rb

SELECT * FROM "users"
---
  def new
    @match = Match.new
    @users = User.all

INSERT INTO "matches" ("winning_user_id", "winning_team_id", "game_type", "number_of_rounds", "team", "created_at", "updated_at") VALUES(NULL, NULL, NULL, 5, 't', '2012-03-01 23:30:24', '2012-03-01 23:30:24')
SELECT * FROM "team_users" WHERE ("team_users"."user_id" IN (4,5))
INSERT INTO "teams" ("created_at", "updated_at") VALUES('2012-03-01 23:51:29', '2012-03-01 23:51:29')
INSERT INTO "team_users" ("team_id", "user_id", "created_at", "updated_at") VALUES(2, 4, '2012-03-02 00:08:40', '2012-03-02 00:08:40')
SELECT * FROM "users" WHERE ("users"."name" IN ('towski','anthony'))
INSERT INTO "match_teams" ("match_id", "team_id", "created_at", "updated_at") VALUES(7, 6, '2012-03-02 00:08:59', '2012-03-02 00:08:59')
INSERT INTO "matches_users" ("match_id", "user_id", "created_at", "updated_at") VALUES(5, 4, '2012-03-01 22:52:50', '2012-03-01 22:52:50')
---
  def create
    match = Match.create params[:match]
    if match.team?
      first_team = Team.find_by_users params[:users][0..1]
      if first_team.nil?
        first_team = Team.create!
        first_team.users << User.find_by_name(params[:users][0])
        first_team.users << User.find_by_name(params[:users][1])
      end
      second_team = Team.find_by_users params[:users][2..3]
      if second_team.nil?
        second_team = Team.create!
        second_team.users << User.find_by_name(params[:users][2])
        second_team.users << User.find_by_name(params[:users][3])
      end
      match.teams << first_team
      match.teams << second_team
    else
      params[:users].each_with_index do |user, index|
        MatchesUser.create(:user => User.find_by_name(user), :match => match)