app/controllers/rounds_controller.rb

SELECT * FROM "matches" WHERE ("matches"."id" = 7)
---
  def new
    @round = Round.new
    @match = Match.find params[:match_id]

SELECT * FROM "matches" WHERE ("matches"."id" = 7)
INSERT INTO "rounds" ("winning_user_id", "winning_team_id", "match_id", "created_at", "updated_at") VALUES(NULL, NULL, NULL, '2012-03-01 23:00:14', '2012-03-01 23:00:14')
---
  def create
    @match = Match.find params[:match_id]
    @round = Round.create params[:round].merge(:match => @match)