app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES('', '2012-03-01 22:37:01', '2012-03-01 22:37:01')
---
  def create
    User.create params[:user]